index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-14 Sun 15:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="deaniacseo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#blog_main_page">1. Trada Blog</a>
<ul>
<li><a href="#org47e9789">1.1. Programming</a></li>
<li><a href="#org82ae71e">1.2. Boarding</a></li>
<li><a href="#org74ed512">1.3. Trips</a></li>
<li><a href="#org35b5127">1.4. Credits</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-blog_main_page" class="outline-2">
<h2 id="blog_main_page"><span class="section-number-2">1.</span> Trada Blog</h2>
<div class="outline-text-2" id="text-blog_main_page">
<p>
Hello, my name is Dean Seo.
</p>

<p>
I am a seasoned C++ developer specializing in the creation of low-latency, high-performance applications.
With a deep understanding of modern C++ techniques, I am dedicated to optimizing software to operate at the peak of efficiency.
</p>

<p>
My passion lies in tackling complex coding challenges and transforming them into elegantly engineered solutions that push the boundaries of technological capabilities.
Over the years, I have honed my skills in system architecture and performance engineering, focusing on delivering robust solutions in fast-paced environments.
</p>

<p>
Whether it's refining processes or pioneering new software innovations, my goal is to enhance user experience through exceptional speed and reliability, ensuring that every line of code not only meets but exceeds the rigorous demands of today's tech landscape.
</p>

<p>
You can reach me via <b>deaniac.seo@gmail.com</b> anytime!
</p>
</div>

<div id="outline-container-org47e9789" class="outline-3">
<h3 id="org47e9789"><span class="section-number-3">1.1.</span> Programming</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="Programming/seqlock.html">Implement a thread-safe, single-producer multi-consumer SeqLock</a></li>
</ul>
</div>
</div>

<div id="outline-container-org82ae71e" class="outline-3">
<h3 id="org82ae71e"><span class="section-number-3">1.2.</span> Boarding</h3>
<div class="outline-text-3" id="text-1-2">
<p>
.
</p>
</div>
</div>

<div id="outline-container-org74ed512" class="outline-3">
<h3 id="org74ed512"><span class="section-number-3">1.3.</span> Trips</h3>
<div class="outline-text-3" id="text-1-3">
<p>
.
</p>
</div>
</div>

<div id="outline-container-org35b5127" class="outline-3">
<h3 id="org35b5127"><span class="section-number-3">1.4.</span> Credits</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This blog is entirely written by <a href="https://orgmode.org/">org-mode</a>.
I mainly used <a href="https://github.com/fniessen/org-html-themes">fniessen's themes</a> to make it look <i>modern</i>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: deaniacseo</p>
<p class="date">Created: 2024-04-14 Sun 15:15</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
